// Завдання 4
// На рахунку користувача є 23580 кредитів, значення зберігається в змінній credits (створи і привласни). Користувач вирішує купити ремонтних дроїд, які коштують по 3000 кредитів за штуку. Ціна одного дроїда зберігається в змінній pricePerDroid (створи і привласни).

// При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість дроїдів, які користувач хоче купити і зберегти в змінну.

// Напиши скрипт який:

// Якщо в prompt була натиснута кнопка Cancel, виводить в консоль повідомлення 'Скасовано користувачем!'.
// В іншому випадку, розраховує загальну ціну замовлення і зберігає в змінній totalPrice.
// Перевіряє чи зможе користувач оплатити замовлення:
// якщо сума до оплати перевищує кількість кредитів на рахунку, виводь в консоль повідомлення 'Недостатньо коштів на рахунку!'.
// в іншому випадку необхідно порахувати залишок кредитів на рахунку і вивести повідомлення 'Ви купили [число] дроїдів, на рахунку залишилося [число] кредитів.'.?
let credits = 23580;
let pricePerDroid = 3000;
const message = "How many Do you want buy 'Droids'?Write in thing";
let  put = prompt(message);
if(credits < pricePerDroid){
    const atention = 'Недостатньо коштів на рахунку!';
    console.log(atention);
} else if(put === null) {
    const wrong = 'Скасовано користувачем!';
    console.log(wrong)
} else if(credits > pricePerDroid){
    const totalPrice = put*pricePerDroid;
    console.log(totalPrice);
}
